RIOT-OS/RIOT/cpu/psoc6/include/vendor/ip/cyip_gpio_v5.h
#define GPIO_PRT_V5_CFG_OUT2_DS_TRIM7_Msk       0xE00000UL
/* GPIO_PRT.CFG_SLEW_EXT */
#define GPIO_PRT_V5_CFG_SLEW_EXT_SLEW0_Pos      0UL
#define GPIO_PRT_V5_CFG_SLEW_EXT_SLEW0_Msk      0x7UL
#define GPIO_PRT_V5_CFG_SLEW_EXT_SLEW1_Pos      4UL
#define GPIO_PRT_V5_CFG_SLEW_EXT_SLEW1_Msk      0x70UL
#define GPIO_PRT_V5_CFG_SLEW_EXT_SLEW2_Pos      8UL
#define GPIO_PRT_V5_CFG_SLEW_EXT_SLEW2_Msk      0x700UL
#define GPIO_PRT_V5_CFG_SLEW_EXT_SLEW3_Pos      12UL
#define GPIO_PRT_V5_CFG_SLEW_EXT_SLEW3_Msk      0x7000UL
#define GPIO_PRT_V5_CFG_SLEW_EXT_SLEW4_Pos      16UL
#define GPIO_PRT_V5_CFG_SLEW_EXT_SLEW4_Msk      0x70000UL
#define GPIO_PRT_V5_CFG_SLEW_EXT_SLEW5_Pos      20UL
#define GPIO_PRT_V5_CFG_SLEW_EXT_SLEW5_Msk      0x700000UL
#define GPIO_PRT_V5_CFG_SLEW_EXT_SLEW6_Pos      24UL
#define GPIO_PRT_V5_CFG_SLEW_EXT_SLEW6_Msk      0x7000000UL
#define GPIO_PRT_V5_CFG_SLEW_EXT_SLEW7_Pos      28UL
#define GPIO_PRT_V5_CFG_SLEW_EXT_SLEW7_Msk      0x70000000UL
/* GPIO_PRT.CFG_DRIVE_EXT0 */
#define GPIO_PRT_V5_CFG_DRIVE_EXT0_DRIVE_SEL_EXT0_Pos 0UL
#define GPIO_PRT_V5_CFG_DRIVE_EXT0_DRIVE_SEL_EXT0_Msk 0x1FUL
#define GPIO_PRT_V5_CFG_DRIVE_EXT0_DRIVE_SEL_EXT1_Pos 8UL
#define GPIO_PRT_V5_CFG_DRIVE_EXT0_DRIVE_SEL_EXT1_Msk 0x1F00UL
#define GPIO_PRT_V5_CFG_DRIVE_EXT0_DRIVE_SEL_EXT2_Pos 16UL
#define GPIO_PRT_V5_CFG_DRIVE_EXT0_DRIVE_SEL_EXT2_Msk 0x1F0000UL
#define GPIO_PRT_V5_CFG_DRIVE_EXT0_DRIVE_SEL_EXT3_Pos 24UL
#define GPIO_PRT_V5_CFG_DRIVE_EXT0_DRIVE_SEL_EXT3_Msk 0x1F000000UL
/* GPIO_PRT.CFG_DRIVE_EXT1 */
#define GPIO_PRT_V5_CFG_DRIVE_EXT1_DRIVE_SEL_EXT4_Pos 0UL
#define GPIO_PRT_V5_CFG_DRIVE_EXT1_DRIVE_SEL_EXT4_Msk 0x1FUL
#define GPIO_PRT_V5_CFG_DRIVE_EXT1_DRIVE_SEL_EXT5_Pos 8UL
#define GPIO_PRT_V5_CFG_DRIVE_EXT1_DRIVE_SEL_EXT5_Msk 0x1F00UL
#define GPIO_PRT_V5_CFG_DRIVE_EXT1_DRIVE_SEL_EXT6_Pos 16UL
#define GPIO_PRT_V5_CFG_DRIVE_EXT1_DRIVE_SEL_EXT6_Msk 0x1F0000UL
#define GPIO_PRT_V5_CFG_DRIVE_EXT1_DRIVE_SEL_EXT7_Pos 24UL
#define GPIO_PRT_V5_CFG_DRIVE_EXT1_DRIVE_SEL_EXT7_Msk 0x1F000000UL


/* GPIO.INTR_CAUSE0 */
#define GPIO_V5_INTR_CAUSE0_PORT_INT_Pos        0UL
#define GPIO_V5_INTR_CAUSE0_PORT_INT_Msk        0xFFFFFFFFUL
/* GPIO.INTR_CAUSE1 */
#define GPIO_V5_INTR_CAUSE1_PORT_INT_Pos        0UL
#define GPIO_V5_INTR_CAUSE1_PORT_INT_Msk        0xFFFFFFFFUL
/* GPIO.INTR_CAUSE2 */
#define GPIO_V5_INTR_CAUSE2_PORT_INT_Pos        0UL
#define GPIO_V5_INTR_CAUSE2_PORT_INT_Msk        0xFFFFFFFFUL
/* GPIO.INTR_CAUSE3 */
#define GPIO_V5_INTR_CAUSE3_PORT_INT_Pos        0UL
#define GPIO_V5_INTR_CAUSE3_PORT_INT_Msk        0xFFFFFFFFUL
/* GPIO.VDD_ACTIVE */
#define GPIO_V5_VDD_ACTIVE_VDDIO_ACTIVE_Pos     0UL
#define GPIO_V5_VDD_ACTIVE_VDDIO_ACTIVE_Msk     0xFFFFUL
#define GPIO_V5_VDD_ACTIVE_VDDA_ACTIVE_Pos      30UL
#define GPIO_V5_VDD_ACTIVE_VDDA_ACTIVE_Msk      0x40000000UL
#define GPIO_V5_VDD_ACTIVE_VDDD_ACTIVE_Pos      31UL
#define GPIO_V5_VDD_ACTIVE_VDDD_ACTIVE_Msk      0x80000000UL
/* GPIO.VDD_INTR */
#define GPIO_V5_VDD_INTR_VDDIO_ACTIVE_Pos       0UL
#define GPIO_V5_VDD_INTR_VDDIO_ACTIVE_Msk       0xFFFFUL
#define GPIO_V5_VDD_INTR_VDDA_ACTIVE_Pos        30UL
#define GPIO_V5_VDD_INTR_VDDA_ACTIVE_Msk        0x40000000UL
#define GPIO_V5_VDD_INTR_VDDD_ACTIVE_Pos        31UL
#define GPIO_V5_VDD_INTR_VDDD_ACTIVE_Msk        0x80000000UL
/* GPIO.VDD_INTR_MASK */
#define GPIO_V5_VDD_INTR_MASK_VDDIO_ACTIVE_Pos  0UL
#define GPIO_V5_VDD_INTR_MASK_VDDIO_ACTIVE_Msk  0xFFFFUL
#define GPIO_V5_VDD_INTR_MASK_VDDA_ACTIVE_Pos   30UL
#define GPIO_V5_VDD_INTR_MASK_VDDA_ACTIVE_Msk   0x40000000UL
#define GPIO_V5_VDD_INTR_MASK_VDDD_ACTIVE_Pos   31UL
#define GPIO_V5_VDD_INTR_MASK_VDDD_ACTIVE_Msk   0x80000000UL
/* GPIO.VDD_INTR_MASKED */
#define GPIO_V5_VDD_INTR_MASKED_VDDIO_ACTIVE_Pos 0UL
#define GPIO_V5_VDD_INTR_MASKED_VDDIO_ACTIVE_Msk 0xFFFFUL
#define GPIO_V5_VDD_INTR_MASKED_VDDA_ACTIVE_Pos 30UL
#define GPIO_V5_VDD_INTR_MASKED_VDDA_ACTIVE_Msk 0x40000000UL
#define GPIO_V5_VDD_INTR_MASKED_VDDD_ACTIVE_Pos 31UL
#define GPIO_V5_VDD_INTR_MASKED_VDDD_ACTIVE_Msk 0x80000000UL
/* GPIO.VDD_INTR_SET */
#define GPIO_V5_VDD_INTR_SET_VDDIO_ACTIVE_Pos   0UL
#define GPIO_V5_VDD_INTR_SET_VDDIO_ACTIVE_Msk   0xFFFFUL
#define GPIO_V5_VDD_INTR_SET_VDDA_ACTIVE_Pos    30UL
#define GPIO_V5_VDD_INTR_SET_VDDA_ACTIVE_Msk    0x40000000UL
#define GPIO_V5_VDD_INTR_SET_VDDD_ACTIVE_Pos    31UL
#define GPIO_V5_VDD_INTR_SET_VDDD_ACTIVE_Msk    0x80000000UL
/* GPIO.VDD_LVL */
#define GPIO_V5_VDD_LVL_VDDIO_LVL_Pos           0UL
#define GPIO_V5_VDD_LVL_VDDIO_LVL_Msk           0xFFFFUL


#endif /* _CYIP_GPIO_V5_H_ */


/* [] END OF FILE */
